In [28]:
import pandas as pd
import numpy as np
import warnings
warnings.filterwarnings("ignore")
import scipy.stats as stats

In [2]:
testing = pd.read_csv('Testing_Of_Hypothesis.csv')
testing.head(5)

   Sr No S_Cust_id  Samsung Score Apple_Cust_id  Apple_Score
0      1   S336499             94       A336525           82
1      2    S73004             99        A73011           83
2      3    S79537             74        A79538           88
3      4   S769168             74       A769222           80
4      5   S609791             83       A609801           74

# Business Problem

#### This is a peer comparison project. Suppose that you are working for Samsung in customer experience management team. The idea is to regularly monitor the customer satisfaction levels and peer company moves. The competitor company is Apple. The objective is to test two main hypothesis.

##### 1. The Samsung Average customer satisfaction score is minimum 75%.

In [10]:
samsung = testing[['S_Cust_id', 'Samsung Score']]
samsung

   S_Cust_id  Samsung Score
0    S336499             94
1     S73004             99
2     S79537             74
3    S769168             74
4    S609791             83
..       ...            ...
95   S285617             77
96   S324135             85
97   S292076             83
98   S936528             82
99   S489010            100

[100 rows x 2 columns]

##### Step: 1 -> Null hypothesis -: H0: Samsung Average customer satisfaction score is minimum 75%
##### Step: 2 -> Alternate hypothesis -: Ha: Samsung Average customer satisfaction score is not minimum 75%
##### Step: 3 -> Confidence Level -: 0.01
##### Step: 4 -> Decision Rule -: 99%
##### Step: 5 -> Test statistic -: 1 sample T-Test

In [23]:
print(" Samsung's Average Customer satisfaction score is {}".format(samsung['Samsung Score'].mean()))

 Samsung's Average Customer satisfaction score is 84.9

In [21]:
samsung_t = stats.ttest_1samp(samsung['Samsung Score'], 75)

In [22]:
print('Pvalue is {}'.format(samsung_t.pvalue))
p = samsung_t.pvalue

if( p < 0.01):
    print('We reject Null hypothesis')
else:
    print('We fail to reject null hypothesis')

Pvalue is 4.0739777034636007e-13
We reject Null hypothesis

##### Step: 6 -> As the p is low, Null will go. We can reject the Null hypothesis and can conclude Samsung Average customer satisfaction score is not minimum of 75%. As per the previous calculation the score is 84% which is indeed greater than 75%.

# =============================================================

##### 2. The overall average satisfaction score of Samsung is same as Apple. There is no significant difference in the satisfaction scores

In [24]:
apple = testing[['Apple_Cust_id' , 'Apple_Score']]
apple

   Apple_Cust_id  Apple_Score
0        A336525           82
1         A73011           83
2         A79538           88
3        A769222           80
4        A609801           74
..           ...          ...
95       A285629           87
96       A324151           82
97       A292091           88
98       A936566           91
99       A489031           95

[100 rows x 2 columns]

In [25]:
print(" Samsung's Average Customer satisfaction score is {}".format(samsung['Samsung Score'].mean()))
print(" Apples's Average Customer satisfaction score is {}".format(apple['Apple_Score'].mean()))

 Samsung's Average Customer satisfaction score is 84.9
 Apples's Average Customer satisfaction score is 87.81

##### Step: 1 -> Null hypothesis -: H0: Samsung Average customer satisfaction score == Apple Average customer satisfaction score 
##### Step: 2 -> Alternate hypothesis -: Ha: Samsung Average customer satisfaction score != Apple Average customer satisfaction score
##### Step: 3 -> Confidence Level -: 0.05
##### Step: 4 -> Decision Rule -: 95%
##### Step: 5 -> Test statistic -: Paired T-Test

In [27]:
sam_vs_apple= stats.ttest_ind(samsung['Samsung Score'], apple['Apple_Score'])

print('Pvalue is {}'.format(sam_vs_apple.pvalue))
p = sam_vs_apple.pvalue

if( p < 0.05):
    print('We reject Null hypothesis')
else:
    print('We fail to reject null hypothesis')

Pvalue is 0.058042614444118075
We fail to reject null hypothesis

##### Step: 6 -> We failed tp reject null hypothesis. It can be concluded there is no significant difference in Samsung's and Apples customer satisfaction scores.